Public Attributes | List of all members
API_DashItems Struct Reference
Attribute Management
Describes one segment of a dashed line. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 double  | dash
The length of the dash of a dashed line.
 double  | gap
The length of the gap of a dashed line.
Detailed Description
Describes one segment of a dashed line.
Remarks
The total length of one segment is calculated by adding the two components together. A detailed description can be found at API_LinetypeType.